In [123]:
import pandas as pd 
import numpy as np
import seaborn as sns

# 1. Titanic - sns.load_dataset('titanic')

## a.타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨

### 1)20살이 넘으면 성별을 그대로 사용한다.

###  2)20살 미만이면 성별에 관계없이 “child”라고 한다.

In [124]:
titanic=sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [125]:
titanic.groupby(titanic.survived).describe()

         pclass                                                 age  \
          count      mean       std  min  25%  50%  75%  max  count
survived
0         549.0  2.531876  0.735805  1.0  2.0  3.0  3.0  3.0  424.0
1         342.0  1.950292  0.863321  1.0  1.0  2.0  3.0  3.0  290.0

                     ... parch        fare                             \
               mean  ...   75%  max  count       mean        std  min
survived             ...
0         30.626179  ...   0.0  6.0  549.0  22.117887  31.388207  0.0
1         28.343690  ...   1.0  5.0  342.0  48.395408  66.596998  0.0


              25%   50%   75%       max
survived
0          7.8542  10.5  26.0  263.0000
1         12.4750  26.0  57.0  512.3292

[2 rows x 40 columns]

In [126]:
titanic['adult/child'] = titanic.apply(lambda r: r.sex if r.age >= 20 else 'child', axis=1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male

## b.타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오.

In [127]:
titanic.mean()['age']

29.69911764705882

In [122]:
titanic['age']=round(titanic['age'].fillna(titanic.mean()['age']))
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,30.0,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

## c.성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

In [203]:
def alivecount(x):
    return x/891

In [208]:
titanic.pivot_table('survived',['class','sex'],['embark_town'],
                 aggfunc='sum', fill_value=0).agg(alivecount)

embark_town    Cherbourg  Queenstown  Southampton
class  sex
First  female   0.047138    0.001122     0.051627
       male     0.019080    0.000000     0.031425
Second female   0.007856    0.002245     0.068462
       male     0.002245    0.000000     0.016835
Third  female   0.016835    0.026936     0.037037
       male     0.011223    0.003367     0.038159

# 2. Mile Per Gallon - sns.load_dataset('mpg')

## a.배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.


## b.name으로부터 manufacturer(제조사)와 모델을 추출하여
## 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.


## c.엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.

## d.생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.


## e.모델이 5개 이상인 제조사에 대하여
## 연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.